src/1C/Enums/ВидыМетодовHTTPЗапроса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыМетодовHTTPЗапроса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>GET</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PUT</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>POST</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DELETE</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OPTIONS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HEAD</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PATCH</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TRACE</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SERVERS</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/1C/Enums/ВидыМетодовHTTPЗапроса/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс
Функция ТипМетода(Тип) Экспорт
	Струкутра = Новый Соответствие;
	Струкутра.Вставить(Перечисления.ВидыМетодовHTTPЗапроса.GET, "get");
	Струкутра.Вставить(Перечисления.ВидыМетодовHTTPЗапроса.PUT, "put");
	Струкутра.Вставить(Перечисления.ВидыМетодовHTTPЗапроса.POST, "post");
	Струкутра.Вставить(Перечисления.ВидыМетодовHTTPЗапроса.DELETE, "delete");
	Струкутра.Вставить(Перечисления.ВидыМетодовHTTPЗапроса.OPTIONS, "options");
	Струкутра.Вставить(Перечисления.ВидыМетодовHTTPЗапроса.HEAD, "head");
	Струкутра.Вставить(Перечисления.ВидыМетодовHTTPЗапроса.PATCH, "patch");
	Струкутра.Вставить(Перечисления.ВидыМетодовHTTPЗапроса.TRACE, "trace");
	Струкутра.Вставить(Перечисления.ВидыМетодовHTTPЗапроса.SERVERS, "servers"); 
	
	Возврат Струкутра[Тип];
КонецФункции
#КонецОбласти
